app/models/user.rb

    def reset_session_token!
        self.session_token = self.class.generate_session_token
        self.save!
---
UPDATE "users" SET "session_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_digest", "PoCyrW7oUvJpA8U-Xyxyhw"], ["updated_at", "2019-05-24 19:36:39.398746"], ["id", 2]]